package com.yc.project3;

public class Maps {
	//有几张地图，每一张地图有多少个数据                               10关，每关为10*10大小的地图
	public static String[][] maps=new String[10][100];
	
	public Maps(){
		// a代表红宝石，加攻击力  	d代表蓝宝石，加防御力 	 x代表墙       h代表英雄      n代表下一关入口      0-9代表对应的怪物坐标       空格代表空地
		maps[0]=new String[]{
			"x","x","x","x","x","x","x","x","x","x",
			"x","a","d","x","x","n","x","x"," ","x",
			"x","x","1","x","x","4","a","2","a","x",
			"x","x"," ","1"," ","d","x","x","d","x",
			"x","x"," ","x","x","a","x","x","a","x",
			"x","x"," ","x","x"," ","x","x","a","x",
			"x","x"," ","x","x"," ","x","x","a","x",
			"x","x","0","x","2","3","a","a","d","x",
			"x","x","h","x","a","x","x","x","x","x",
			"x","x","x","x","x","x","x","x","x","x",
		};
	}
}
